{
  "scene_description": "0-2 sec: Cinematic close-up of the plated muscle meal (grilled chicken, broccoli, rice, boiled eggs, protein shake). Steam rises, camera locked in macro detail.\n\n2-4 sec: A male trainee’s hand (shown from wrist down, face not visible) picks up a fork and brings a bite of chicken to his mouth. As the food is eaten, glowing energy particles radiate outward from his torso.\n\n4-6 sec: The camera shifts to a dynamic dolly-back framing his silhouette from behind (neck down). His muscles pulse with each chew, glowing veins of golden light tracing across arms, shoulders, and back.\n\n6-8 sec: Steam from the food morphs into swirling light ribbons that coil around his body. As he swallows, the ribbons surge into his chest and arms, symbolizing the meal converting into strength.\n\n8-10 sec: His physique expands subtly but powerfully—pecs broaden, deltoids round, biceps flex in silhouette—captured in hyper-real slow motion.\n\n10-12 sec: The glow stabilizes into a radiant aura around him. The camera arcs behind his silhouette, revealing the plate still steaming in the foreground, dumbbell and protein shake beside it.\n\n12-15 sec: Freeze frame hero shot: foreground meal steaming, background male torso glowing with newly enhanced muscularity. Face never shown, only neck-down power shot. Atmosphere fades into warm cinematic light.",
  "visual_style": "Hollywood superhero VFX realism. Hyper-detailed anatomy highlights. Steam transforms into glowing energy ribbons. Photoreal food textures combine with symbolic visual effects.",
  "camera_movement": "Begins with macro static close-up → dolly back during eating → dynamic arc shot as transformation occurs → stabilizes in hero composition.",
  "main_subject": "Male trainee (neck down only) eating a muscle meal and transforming as glowing energy manifests into increased muscularity and aura of strength.",
  "background_setting": "Warm, cinematic kitchen with natural sunlight beams. Abstract glowing energy fills the air as transformation peaks.",
  "lighting_mood": "Mythic yet grounded. Warm golden rays, volumetric god-light, aura pulses synced to each chew. Transformation is illuminated like a superhero awakening.",
  "audio_cue": "Epic cinematic rise. Sub-bass pulses with each bite. Glowing energy accompanied by airy whooshes and crystalline sparkles. Final freeze holds on a sustained chord with subtle heartbeat echo.",
  "color_palette": [
    "#FFD700",
    "#87CEEB",
    "#DA1212",
    "#FFFFFF",
    "#000000"
  ],
  "dialog": "None",
  "subtitles": "OFF"
}